luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCpu_regdef.h
/** \brief  Free CSA List Head Pointer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FCX_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_FCX;

/** \brief  CPU Trap Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_CON_Bits B;            /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_CON;

/** \brief  CPU Trapping Instruction Opcode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_OPC_Bits B;            /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_OPC;

/** \brief  CPU Trapping Instruction Program Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_PC_Bits B;             /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_PC;

/** \brief  CPU Trapping Instruction Operand Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_SRC1_Bits B;           /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_SRC1;

/** \brief  CPU Trapping Instruction Operand Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_SRC2_Bits B;           /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_SRC2;

/** \brief  Trapping Instruction Operand Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_SRC3_Bits B;           /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_SRC3;

/** \brief  Instruction Count */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_ICNT_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_ICNT;

/** \brief  Interrupt Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_ICR_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_ICR;

/** \brief  Interrupt Stack Pointer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_ISP_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_ISP;

/** \brief  Free CSA List Limit Pointer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_LCX_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_LCX;

/** \brief  Multi-Count Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_M1CNT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_M1CNT;

/** \brief  Multi-Count Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_M2CNT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_M2CNT;

/** \brief  Multi-Count Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_M3CNT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_M3CNT;

/** \brief  Program Counter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PC_Bits B;                      /**< \brief Bitfield access */
} Ifx_CPU_PC;

/** \brief  Program Control 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PCON0_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PCON0;

/** \brief  Program Control 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PCON1_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PCON1;

/** \brief  Program Control 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PCON2_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PCON2;

/** \brief  Previous Context Information Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PCXI_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PCXI;

/** \brief  Program Integrity Error Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PIEAR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PIEAR;

/** \brief  Program Integrity Error Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PIETR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PIETR;

/** \brief  Data Access CacheabilityRegister */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PMA0_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PMA0;

/** \brief  Code Access CacheabilityRegister */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PMA1_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PMA1;

